tap "homebrew/bundle"
tap "koekeishiya/formulae"
tap "hashicorp/tap"
tap "majd/repo"
tap "nikitabobko/tap"
tap "go-task/tap"

############ Shells ############

# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# UNIX shell (command interpreter)
brew "zsh"

############ Terminal Environment ############

# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Command-line fuzzy finder written in Go
brew "fzf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Internet file retriever
brew "wget"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Modern, maintained replacement for ls
brew "eza"
# Official tldr client written in Rust
brew "tlrc"
# Programmatically correct mistyped console commands
brew "thefuck"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Color-highlighted diff(1) output
brew "colordiff"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# GNU awk utility
brew "gawk"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Remote terminal application
brew "mosh"
# Port scanning utility for large networks
brew "nmap"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# User interface to the TELNET protocol
brew "telnet"
# Code-search similar to ack
brew "the_silver_searcher"
# CLI tool that moves files or folder to the trash
brew "trash"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Command-line pager for JSON data
brew "jless"

############ Developer Tools ############

# Cross-platform make
brew "cmake"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Official Amazon AWS command-line interface
brew "awscli"
# Statistics utility to count lines of code
brew "cloc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Like cURL, but for gRPC
brew "grpcurl"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Kubernetes package manager
brew "helm"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Command-line tools for converting between MessagePack and JSON
brew "msgpack-tools"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Vi 'workalike' with many additional features
brew "vim"
# CLI utility to build and manage a PKI CA
brew "easy-rsa"
# CloudFlare's PKI toolkit
brew "cfssl"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Tool to build, change, and version infrastructure
brew "terraform"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# Command-line tool to manage cert-manager
brew "cmctl"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"

############ Programming Languages ############

# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Debugger for the Go programming language
brew "delve"
# Go support for Google's protocol buffers
brew "protoc-gen-go"
# Protoc plugin that generates code for gRPC-Go clients
brew "protoc-gen-go-grpc"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Rust toolchain installer
brew "rustup"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Development kit for the Java programming Languages
brew "openjdk"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Extensible command-line tool to format YAML files
brew "yamlfmt"
# Platform built on V8 to build network applications
brew "node"
# Package acting as bridge between Node projects and their package managers
brew "corepack" # installs yarn
# Your favorite rust -> wasm workflow tool!
brew "wasm-pack"

############ Other ############

# Tool for managing your YubiKey configuration
brew "ykman"
# YubiKey personalization library and tool
brew "ykpers"
# Provides an easy way to use U2F-compliant authenticators with PAM
brew "pam-u2f"
# Utility for IPMI control with kernel driver or LAN interface
brew "ipmitool"

############ Web Browsers ############

# Web browser
cask "firefox"
# Web browser
cask "google-chrome"

############ Security ############

# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Host-based application firewall
cask "little-snitch"
# Monitors and reports any microphone and camera activity
cask "micro-snitch"
# VPN and encryption software
cask "encryptme"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# OpenVPN client with AppleScript support
cask "viscosity"
# Application for generating TOTP and HOTP codes
cask "yubico-authenticator"
# Application for configuring any YubiKey
cask "yubico-yubikey-manager"

############ Productivity ############

# Application launcher and productivity software
cask "alfred"
# App for note taking, organising, task lists, and archiving
cask "evernote"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"

############ Developer Tools ############

# Developer targeted fonts with a high number of glyphs
cask "font-caskaydia-cove-nerd-font"
# GPU-accelerated terminal emulator
cask "alacritty"
# Graphical client for Git version control
cask "sourcetree"
# Tools for building Android applications
cask "android-studio"
# App to build and share containerised applications and microservices
cask "docker"
# GUI for the Neovim text editor
cask "vimr"
# CLI tool for searching and downloading iOS app packages from the App Store
cask "ipatool"
# Inspect application bundles
cask "apparency"

############ Creativity ############

# Professional graphic design software
cask "affinity-designer"
